using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Net.Http;
using Newtonsoft.Json;
using WpfApp2.Componens; 
namespace WpfApp2.Componens
{
   public static class NetManager
    {
        public static string URL = "http://localhost:65372/";
        public static HttpClient httpClient = new HttpClient();

        public static async Task<T> Get<T>(string controller)
        {
            var response = await httpClient.GetAsync(URL + controller);
            var data = JsonConvert.DeserializeObject<T>(await response.Content.ReadAsStringAsync());
            return data;

        }
        // /ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\/ᐠ｡ꞈ｡ᐟ\
        public static async Task<HttpResponseMessage> Post<T>(string controller, T data) 
        {
            var jsonData = JsonConvert.SerializeObject(data);
            var respone = await httpClient.PostAsync(URL + controller, new StringContent(jsonData, Encoding.UTF8, "aplication/json"));
            return respone;

        }

        public static async Task<HttpResponseMessage> Put<T>( string controller, T data) 
        {
            var jsonData = JsonConvert.SerializeObject(data);
            var respone = await httpClient.PostAsync(URL + controller, new StringContent(jsonData, Encoding.UTF8, "aplication/json"));
            return respone;
        }
        public static async Task<HttpResponseMessage> Delete<T>(string controller, T data) 
        {
            var respone = await httpClient.DeleteAsync(URL + controller);
            return respone;
        }
    }
}
